In [1]:
import numpy as np
import pandas as pd

#### Loading the CSV data into a DataFrame

In [4]:
salaries_data = pd.read_csv("Data/Salaries.csv")
salaries_data.head(2)

C:\Users\riyaj\AppData\Local\Temp\ipykernel_46024\3048989902.py:1: DtypeWarning: Columns (0: BasePay, 1: OvertimePay, 2: OtherPay, 3: Benefits, 4: Status) have mixed types. Specify dtype option on import or set low_memory=False.
  salaries_data = pd.read_csv("Data/Salaries.csv")

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN

#### Getting to know the MESSY data!

In [5]:
print(f"Shape: {salaries_data.shape}")
print(f"Columns: {salaries_data.columns}")

Shape: (148654, 13)
Columns: Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='str')

In [17]:
salaries_data.info()

<class 'pandas.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  str
 2   JobTitle          148654 non-null  str
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Agency            148654 non-null  str
 11  Status            38119 non-null   str
dtypes: float64(2), int64(2), object(4), str(4)
memory usage: 13.6+ MB

In [21]:
salaries_data.describe()

                  Id       TotalPay  TotalPayBenefits           Year
count  148654.000000  148654.000000     148654.000000  148654.000000
mean    74327.500000   74768.321972      93692.554811    2012.522643
std     42912.857795   50517.005274      62793.533483       1.117538
min         1.000000    -618.130000       -618.130000    2011.000000
25%     37164.250000   36168.995000      44065.650000    2012.000000
50%     74327.500000   71426.610000      92404.090000    2013.000000
75%    111490.750000  105839.135000     132876.450000    2014.000000
max    148654.000000  567595.430000     567595.430000    2014.000000

In [16]:
salaries_data.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Agency                   0
Status              110535
dtype: int64

In [15]:
# Dropping notes column since it doesnt have any not null values!!
# salaries_data.drop(columns="Notes", inplace=True)
salaries_data.head(1)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,San Francisco,NaN

In [22]:
print(f"Unique values in BasePay Column: {salaries_data['BasePay'].unique()}")
print(f"Unique values in OvertimePay Column: {salaries_data['OvertimePay'].unique()}")
print(f"Unique values in OtherPay Column: {salaries_data['OtherPay'].unique()}")
print(f"Unique values in Benefits Column: {salaries_data['Benefits'].unique()}")
print(f"Unique values in Status Column: {salaries_data['Status'].unique()}")

Unique values in BasePay Column: [167411.18 155966.02 212739.13 ... '6.04' '15.50' 'Not Provided']
Unique values in OvertimePay Column: [0.0 245131.88 106088.18 ... '102.70' '56.77' 'Not Provided']
Unique values in OtherPay Column: [400184.25 137811.38 16452.6 ... '13.35' 'Not Provided' '-618.13']
Unique values in Benefits Column: [nan 44430.12 69810.19 ... '0.13' '1.24' 'Not Provided']
Unique values in Status Column: <StringArray>
[nan, 'PT', 'FT']
Length: 3, dtype: str